Revit 2027 API
Definitions.Create Method
Creates a new parameter definition using specified options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Definition Create(
	ExternalDefinitionCreationOptions option
)
Public Function Create (
	option As ExternalDefinitionCreationOptions
) As Definition
public:
Definition^ Create(
	ExternalDefinitionCreationOptions^ option
)
member Create :
        option : ExternalDefinitionCreationOptions -> Definition
Parameters
option ExternalDefinitionCreationOptions
The options used to create the new parameter definition.
Return Value
Definition
If successful a reference to the new parameter definition is returned, otherwise null.
Remarks
This method only supports creation of new external definitions (shared parameters).
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace